const Aksharas = require("../dist/index.cjs").default;

const input = `ॐ ॐ ॐ ॐ ॐ 

हं ॐ नमो व्योमरूपाय व्यापिने शिवायानन्तायानाथायानाश्रिताय,  
ध्रुवाय शाश्वताय  
योगपीठादिसंस्थिताय नित्ययोगिने ध्यानाहाराय ।

ॐ नमः शिवायेशान-मूर्ध्नाय, तत्पुरुष-वक्त्रायाघोर-हृदयाय, वामदेव-गुह्याय, सद्योजात-मूर्तये ।

ॐ नमो गुह्यादि-गुह्याय गोप्त्रे ऽनिधनाय सर्व-विद्याधिपाय ज्योतीरूपाय परमेश्वर-पराय! 
अचेतनाचेतन । व्योमिन् व्योमिन्  । व्यापिन् व्यापिन्न् । अरूपिन्न् अरूपिन् । प्रथम प्रथम । तेजस् तेजः । ज्योतिर् ज्योतिर् अरूपानग्ने ऽधूम ऽभस्मानादे ।

ना ना ना ना । धू धू धू धू ।  
ॐ भूर्भुवः स्वः ।  
अनिधन । निधनोद्भव ।  
शिव । शर्व । सर्वपर । महेश्वर । महादेव । सद्भावेश्वर । महातेज । योगाधिपते!  
मुञ्च मुञ्च प्रमथ प्रमथ ।  
शिव । शर्व । भवोद्भव -  
विध्य विध्य ।  
वामदेव । सर्व-भूत-सुखप्रद । सर्व- सांनिध्यकर । ब्रह्मा-विष्णु-रुद्र-परानर्चितानर्चितासंस्थितासंस्थित । पूर्वस्थित पूर्वस्थित । साक्षिन् साक्षिन् ।  
तुरु तुरु । पतङ्गपतङ्ग । ज्ञान  ज्ञान । शब्द शब्द । सूक्ष्म सूक्ष्म ।  
शिव । शर्व । सर्वद ।  
ॐ नमः शिवाय,  
ॐ ह्रीं शिवाय,  
ॐ हं ह्रीं शिवाय,  
ॐ नमो नमः ॥
`.repeat(101);

const t0 = performance.now();

const results = Aksharas.analyse(input);

const t1 = performance.now();
console.log(`Call to doSomething took ${t1 - t0} milliseconds.`);

console.log(input.length);
console.log(results.aksharas.length);

// console.log(
//   JSON.stringify(
//     results.all.map((Token) => (Token.type === "akshara" ? Token.value : " ")),
//     undefined,
//     1
//   )
// );
